In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\nidhi\anaconda3\lib\site-packages (2.2.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy>=1.26.0 in c:\users\nidhi\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\nidhi\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\nidhi\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\nidhi\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\nidhi\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [4]:
import pandas as pd
series1=pd.Series([10,20,30]) #Series should be capital as pandas  has by default series im  capital
print(series1)

0    10
1    20
2    30
dtype: int64

In [5]:
series2=pd.Series(['Kavi','Shyam','Ravi'],index=[3,5,1])
print(series2)

3     Kavi
5    Shyam
1     Ravi
dtype: object

In [6]:
series1=pd.Series([20,30,40])
print(series1)

0    20
1    30
2    40
dtype: int64

In [7]:
import numpy as np
import pandas as pd
array1=np.array([1,2,3,4])
series3=pd.Series(array1)
print(series3)

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
series4=pd.Series(array1,index=['Jan','Feb','Mar','April'])
print(series4)

Jan      1
Feb      2
Mar      3
April    4
dtype: int64

In [9]:
dict1={'India':'NewDelhi','UR':'London','Japan':'Tokyo'}
print(dict1)

{'India': 'NewDelhi', 'UR': 'London', 'Japan': 'Tokyo'}

In [10]:
series8=pd.Series(dict1)
print(series8)

India    NewDelhi
UR         London
Japan       Tokyo
dtype: object

In [12]:
seriesNum=pd.Series([10,20,30])
seriesNum

0    10
1    20
2    30
dtype: int64

In [14]:
seriesMaths=pd.Series([2,3,4],index=['Feb','Mar','Apr'])
seriesMaths['Mar']

np.int64(3)

In [16]:
seriescapcntry=pd.Series(['NewDelhi','Washington','London'],index=['India','USA','UK'])
seriescapcntry

India      NewDelhi
USA      Washington
UK           London
dtype: object

In [18]:
seriescapcntry[1:3]

USA    Washington
UK         London
dtype: object

In [19]:
import numpy as np
series123=pd.Series(np.arange(10,20,1))
print(series123)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [20]:
series123.head(2)

0    10
1    11
dtype: int64

In [3]:
import pandas as pd

In [4]:
seriesA=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
seriesA

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [6]:
seriesB=pd.Series([10,20,-10,-50,100],index=['z','y','a','c','e'])
seriesB

z     10
y     20
a    -10
c    -50
e    100
dtype: int64

In [5]:
seriesT= pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
seriesT

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
seriesI=pd.Series([10,20,-10,-50,100],index=['z','y','a','c','e'])
seriesI

z     10
y     20
a    -10
c    -50
e    100
dtype: int64

In [8]:
seriesT + seriesI

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [9]:
seriesA+seriesB

a     -9.0
b      NaN
c    -47.0
d      NaN
e    105.0
y      NaN
z      NaN
dtype: float64

In [10]:
seriesA-seriesB

a    11.0
b     NaN
c    53.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [11]:
seriesA*seriesB

a    -10.0
b      NaN
c   -150.0
d      NaN
e    500.0
y      NaN
z      NaN
dtype: float64

In [12]:
seriesA/seriesB

a   -0.10
b     NaN
c   -0.06
d     NaN
e    0.05
y     NaN
z     NaN
dtype: float64

In [13]:
seriesA//seriesB

a   -1.0
b    NaN
c   -1.0
d    NaN
e    0.0
y    NaN
z    NaN
dtype: float64

In [14]:
seriesT - seriesI

a    11.0
b     NaN
c    53.0
d     NaN
e   -95.0
y     NaN
z     NaN
dtype: float64

In [15]:
seriesT - seriesI

a    -10.0
b      NaN
c   -150.0
d      NaN
e    500.0
y      NaN
z      NaN
dtype: float64

In [16]:
seriesT / seriesI

a   -0.10
b     NaN
c   -0.06
d     NaN
e    0.05
y     NaN
z     NaN
dtype: float64

In [17]:
seriesT // seriesI

a   -1.0
b    NaN
c   -1.0
d    NaN
e    0.0
y    NaN
z    NaN
dtype: float64

In [20]:
import pandas as pd
import numpy as np
array1 = np.array([10,20,30])
dFrame1 = pd.DataFrame(array1)
dFrame1

    0
0  10
1  20
2  30

In [19]:
listDict=[{'a':10,'b':20},{'a':5,'b':10,'c':20}]
dFrameListDict = pd.DataFrame(listDict)
dFrameListDict

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [21]:
import pandas as pd
import numpy as np
array1=np.array([10,20,30])
dFrame1=pd.DataFrame(array1)
dFrame1

    0
0  10
1  20
2  30

In [22]:
listDict=[{'a':10,'b':20},{'a':5,'b':10,'c':20}]
dFrameListDict=pd.DataFrame(listDict)
dFrameListDict

    a   b     c
0  10  20   NaN
1   5  10  20.0

In [24]:
seriesA=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
seriesB=pd.Series([1000,2000,-1000,-5000,-10000],index=['a','b','c','d','e'])
seriesC=pd.Series([10,20,-10,-50,100],index=['z','y','a','c','e'])
dFrame6=pd.DataFrame(seriesA)
dFrame6

   0
a  1
b  2
c  3
d  4
e  5

In [25]:
seriesT=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
seriesI=pd.Series([1000,2000,-1000,-5000,-10000],index=['a','b','c','d','e'])
seriesM=pd.Series([10,20,-10,-50,100],index=['z','y','a','c','e'])
dFrame6=pd.DataFrame(seriesT)
dFrame6

   0
a  1
b  2
c  3
d  4
e  5

In [26]:
dFrame7=pd.DataFrame([seriesT,seriesI])
dFrame7

      a     b     c     d      e
0     1     2     3     4      5
1  1000  2000 -1000 -5000 -10000

In [27]:
dFrame7=pd.DataFrame([seriesT,seriesM])
dFrame7

      a    b     c    d      e     z     y
0   1.0  2.0   3.0  4.0    5.0   NaN   NaN
1 -10.0  NaN -50.0  NaN  100.0  10.0  20.0

In [28]:
dFrame7=pd.DataFrame([seriesI,seriesM])
dFrame7

        a       b       c       d        e     z     y
0  1000.0  2000.0 -1000.0 -5000.0 -10000.0   NaN   NaN
1   -10.0     NaN   -50.0     NaN    100.0  10.0  20.0

In [29]:
dFrame7=pd.DataFrame([seriesA,seriesB])
dFrame7

      a     b     c     d      e
0     1     2     3     4      5
1  1000  2000 -1000 -5000 -10000

In [30]:
dFrame7=pd.DataFrame([seriesB,seriesC])
dFrame7

        a       b       c       d        e     z     y
0  1000.0  2000.0 -1000.0 -5000.0 -10000.0   NaN   NaN
1   -10.0     NaN   -50.0     NaN    100.0  10.0  20.0

In [31]:
dFrame7=pd.DataFrame([seriesB,seriesB])
dFrame7

      a     b     c     d      e
0  1000  2000 -1000 -5000 -10000
1  1000  2000 -1000 -5000 -10000